
[
  {
    "id": "dim1",
    "name": "Regulación Emocional y Estrés (Calma en la Tormenta)",
    "definition": "Esta dimensión evalúa tu capacidad para gestionar el estrés, la ansiedad y las emociones intensas sin que te desborden. Mide tu habilidad para mantener la calma en situaciones de presión y para recuperarte emocionalmente tras un contratiempo.",
    "recommendedPathId": "gestion-estres",
    "items": [
      { "id": "d1_1", "text": "Cuando me siento estresado/a, sé cómo calmarme.", "weight": 1 },
      { "id": "d1_2", "text": "Siento que mis emociones me desbordan con facilidad.", "weight": 1, "isInverse": true },
      { "id": "d1_3", "text": "Incluso bajo presión, consigo pensar con claridad.", "weight": 1 },
      { "id": "d1_4", "text": "Me cuesta recuperarme de las pequeñas decepciones del día a día.", "weight": 1, "isInverse": true },
      { "id": "d1_5", "text": "Suelo reaccionar de forma impulsiva cuando siento rabia o frustración.", "weight": 1, "isInverse": true }
    ]
  },
  {
    "id": "dim2",
    "name": "Flexibilidad Mental y Adaptabilidad (Mente Abierta, Cambio Ágil)",
    "definition": "Evalúa tu apertura a nuevas ideas y experiencias, tu capacidad para adaptarte a cambios inesperados y tu habilidad para cuestionar tus propias creencias. Mide cómo de cómodo/a te sientes con la incertidumbre y la ambigüedad.",
    "recommendedPathId": "tolerar-incertidumbre",
    "items": [
      { "id": "d2_1", "text": "Disfruto aprendiendo cosas nuevas, aunque contradigan lo que ya sé.", "weight": 1 },
      { "id": "d2_2", "text": "Me siento incómodo/a cuando las cosas no salen como las había planeado.", "weight": 1, "isInverse": true },
      { "id": "d2_3", "text": "Estoy abierto/a a cambiar de opinión cuando me presentan buenos argumentos.", "weight": 1 },
      { "id": "d2_4", "text": "Me cuesta adaptarme a los imprevistos.", "weight": 1, "isInverse": true },
      { "id": "d2_5", "text": "Me considero una persona creativa y curiosa.", "weight": 1 }
    ]
  },
  {
    "id": "dim3",
    "name": "Autorregulación Personal y Constancia (Foco y Disciplina Consciente)",
    "definition": "Mide tu capacidad para organizarte, mantener hábitos y trabajar de forma disciplinada para conseguir tus metas a largo plazo. No se trata de rigidez, sino de la habilidad para sostener el esfuerzo con intención.",
    "recommendedPathId": "superar-procrastinacion",
    "items": [
      { "id": "d3_1", "text": "Cuando me propongo algo, suelo ser constante hasta conseguirlo.", "weight": 1 },
      { "id": "d3_2", "text": "Me distraigo con facilidad de mis tareas importantes.", "weight": 1, "isInverse": true },
      { "id": "d3_3", "text": "Soy una persona organizada y metódica en mi día a día.", "weight": 1 },
      { "id": "d3_4", "text": "A menudo dejo las cosas para el último momento (procrastino).", "weight": 1, "isInverse": true },
      { "id": "d3_5", "text": "Sé priorizar lo importante frente a lo urgente.", "weight": 1 }
    ]
  },
  {
    "id": "dim4",
    "name": "Autoafirmación y Expresión Personal (Mi Voz, Mi Espacio)",
    "definition": "Evalúa tu capacidad para expresar tus opiniones, necesidades y límites de forma clara y respetuosa. Mide tu seguridad para decir 'no' sin culpa y para defender tus derechos sin agresividad.",
    "recommendedPathId": "poner-limites",
    "items": [
      { "id": "d4_1", "text": "Me siento cómodo/a expresando mi opinión, aunque sea diferente a la de los demás.", "weight": 1 },
      { "id": "d4_2", "text": "A menudo me guardo lo que pienso para evitar conflictos.", "weight": 1, "isInverse": true },
      { "id": "d4_3", "text": "Sé decir 'no' cuando me piden algo que no quiero o no puedo hacer.", "weight": 1 },
      { "id": "d4_4", "text": "Me preocupa mucho lo que los demás piensen de mí.", "weight": 1, "isInverse": true },
      { "id": "d4_5", "text": "Defiendo mis derechos de forma respetuosa pero firme.", "weight": 1 }
    ]
  },
  {
    "id": "dim5",
    "name": "Empatía y Conexión Interpersonal (El Arte de Vincular)",
    "definition": "Mide tu capacidad para conectar con las emociones de los demás, mostrar interés genuino por sus experiencias y construir relaciones basadas en la confianza, el cuidado mutuo y la reciprocidad.",
    "recommendedPathId": "relaciones-autenticas",
    "items": [
      { "id": "d5_1", "text": "Me resulta fácil ponerme en el lugar de los demás.", "weight": 1 },
      { "id": "d5_2", "text": "A veces me cuesta entender por qué la gente se siente como se siente.", "weight": 1, "isInverse": true },
      { "id": "d5_3", "text": "Me considero un buen/a oyente.", "weight": 1 },
      { "id": "d5_4", "text": "Siento que mis relaciones cercanas son una fuente de apoyo y energía.", "weight": 1 },
      { "id": "d5_5",text": "Cuando alguien comparte un problema, mi primer impulso es dar una solución.", "weight": 1, "isInverse": true }
    ]
  },
  {
    "id": "dim6",
    "name": "Insight y Autoconciencia (Mirada Interior)",
    "definition": "Evalúa tu capacidad para mirar hacia dentro, comprender tus propias emociones, pensamientos y patrones de comportamiento. Mide tu nivel de conexión con tu mundo interno y tu curiosidad por entenderte mejor.",
    "recommendedPathId": "comprender-mejor-cada-dia",
    "items": [
      { "id": "d6_1", "text": "Suelo darme cuenta de lo que estoy sintiendo en cada momento.", "weight": 1 },
      { "id": "d6_2", "text": "A veces me sorprendo de mis propias reacciones, como si no me conociera.", "weight": 1, "isInverse": true },
      { "id": "d6_3", "text": "Reflexiono a menudo sobre por qué hago lo que hago.", "weight": 1 },
      { "id": "d6_4", "text": "Me cuesta identificar qué necesito cuando me siento mal.", "weight": 1, "isInverse": true },
      { "id": "d6_5", "text": "Busco momentos para estar a solas y conectar conmigo mismo/a.", "weight": 1 }
    ]
  },
  {
    "id": "dim7",
    "name": "Propósito Vital y Dirección Personal (Mi Brújula Interna)",
    "definition": "Mide tu conexión con tus valores y metas vitales. Evalúa si sientes que tu vida tiene una dirección clara y si tus acciones diarias están alineadas con lo que es verdaderamente importante para ti.",
    "recommendedPathId": "volver-a-lo-importante",
    "items": [
      { "id": "d7_1", "text": "Tengo claro lo que es importante para mí en la vida.", "weight": 1 },
      { "id": "d7_2", "text": "A menudo siento que vivo en 'piloto automático', sin una dirección clara.", "weight": 1, "isInverse": true },
      { "id": "d7_3", "text": "Mis decisiones diarias reflejan mis valores más profundos.", "weight": 1 },
      { "id": "d7_4", "text": "Me siento perdido/a cuando pienso en mi futuro.", "weight": 1, "isInverse": true },
      { "id": "d7_5", "text": "Encuentro sentido y propósito en mis actividades cotidianas.", "weight": 1 }
    ]
  },
  {
    "id": "dim8",
    "name": "Estilo de Afrontamiento y Resiliencia (Fuerza Flexible)",
    "definition": "Evalúa tu capacidad para afrontar las dificultades, adaptarte a la adversidad y aprender de los errores. Mide cómo respondes ante los contratiempos y si tiendes a verlos como oportunidades de crecimiento.",
    "recommendedPathId": "resiliencia-en-accion",
    "items": [
      { "id": "d8_1", "text": "Cuando algo sale mal, busco activamente soluciones.", "weight": 1 },
      { "id": "d8_2", "text": "Me bloqueo o me rindo con facilidad cuando las cosas se ponen difíciles.", "weight": 1, "isInverse": true },
      { "id": "d8_3", "text": "Considero los errores como oportunidades para aprender.", "weight": 1 },
      { "id": "d8_4", "text": "Me cuesta aceptar las críticas constructivas.", "weight": 1, "isInverse": true },
      { "id": "d8_5", "text": "Confío en mi capacidad para superar los obstáculos que se me presentan.", "weight": 1 }
    ]
  },
  {
    "id": "dim9",
    "name": "Integridad y Coherencia Ética (Vivir con Autenticidad)",
    "definition": "Mide el grado de alineación entre tus valores y tus acciones. Evalúa si actúas de forma coherente con tus principios, incluso cuando es difícil, y si tus decisiones reflejan quién quieres ser.",
    "recommendedPathId": "vivir-con-coherencia",
    "items": [
      { "id": "d9_1", "text": "Mis acciones suelen estar en sintonía con mis valores.", "weight": 1 },
      { "id": "d9_2", "text": "A veces hago cosas que van en contra de lo que creo que es correcto.", "weight": 1, "isInverse": true },
      { "id": "d9_3", "text": "Soy honesto/a conmigo mismo/a sobre mis motivaciones.", "weight": 1 },
      { "id": "d9_4", "text": "Me resulta fácil justificar mis acciones, aunque no me sienta del todo bien con ellas.", "weight": 1, "isInverse": true },
      { "id": "d9_5", "text": "Me siento en paz con las decisiones que tomo.", "weight": 1 }
    ]
  },
  {
    "id": "dim10",
    "name": "Responsabilidad Personal y Aceptación Consciente (Mi Poder de Acción)",
    "definition": "Evalúa tu capacidad para hacerte cargo de tu vida, tus decisiones y sus consecuencias, sin caer en la culpa ni en la queja. Mide si te sientes protagonista o víctima de tus circunstancias.",
    "recommendedPathId": "ni-culpa-ni-queja",
    "items": [
      { "id": "d10_1", "text": "Asumo la responsabilidad de mis acciones y sus resultados.", "weight": 1 },
      { "id": "d10_2", "text": "Tiendo a culpar a los demás o a las circunstancias cuando algo sale mal.", "weight": 1, "isInverse": true },
      { "id": "d10_3", "text": "Me enfoco en lo que puedo cambiar, en lugar de quejarme por lo que no puedo.", "weight": 1 },
      { "id": "d10_4", "text": "Me cuesta aceptar que hay cosas que no dependen de mí.", "weight": 1, "isInverse": true },
      { "id": "d10_5", "text": "Siento que tengo el poder de mejorar mi situación actual.", "weight": 1 }
    ]
  },
  {
    "id": "dim11",
    "name": "Apoyo Social Percibido (Mi Red de Cuidado)",
    "definition": "Mide tu percepción sobre la calidad y disponibilidad de tu red de apoyo. Evalúa si sientes que tienes personas en quienes confiar, si te sientes parte de una comunidad y si eres capaz de pedir ayuda cuando lo necesitas.",
    "recommendedPathId": "confiar-en-mi-red",
    "items": [
      { "id": "d11_1", "text": "Siento que tengo personas a las que puedo acudir si tengo un problema.", "weight": 1 },
      { "id": "d11_2", "text": "A menudo me siento solo/a, incluso cuando estoy con gente.", "weight": 1, "isInverse": true },
      { "id": "d11_3", "text": "Me siento cómodo/a pidiendo ayuda cuando la necesito.", "weight": 1 },
      { "id": "d11_4", "text": "Siento que la gente que me rodea me valora y me respeta.", "weight": 1 },
      { "id": "d11_5", "text": "Prefiero arreglármelas solo/a antes que molestar a otros.", "weight": 1, "isInverse": true }
    ]
  },
  {
    "id": "dim12",
    "name": "Estado de Ánimo (Energía Vital)",
    "definition": "Evalúa tu estado emocional general en las últimas semanas. Mide la presencia de emociones agradables (alegría, interés, serenidad) y la ausencia de síntomas depresivos (apatía, tristeza persistente, falta de energía).",
    "recommendedPathId": "volver-a-sentirse-bien",
    "items": [
      { "id": "d12_1", "text": "Me he sentido con energía y optimismo.", "weight": 1 },
      { "id": "d12_2", "text": "He perdido el interés por cosas que antes disfrutaba.", "weight": 1, "isInverse": true },
      { "id": "d12_3", "text": "He sido capaz de reír y ver el lado bueno de las cosas.", "weight": 1 },
      { "id": "d12_4", "text": "Me he sentido triste o vacío/a la mayor parte del tiempo.", "weight": 1, "isInverse": true },
      { "id": "d12_5", "text": "Tengo esperanza en el futuro.", "weight": 1 },
      { "id": "d12_6", "text": "Me ha costado un gran esfuerzo hacer las cosas.", "weight": 1, "isInverse": true },
      { "id": "d12_7", "text": "He sentido que la vida vale la pena.", "weight": 1 },
      { "id": "d12_8", "text": "He tenido pensamientos negativos sobre mí mismo/a.", "weight": 1, "isInverse": true },
      { "id": "d12_9", "text": "Me he sentido tranquilo/a y relajado/a.", "weight": 1 },
      { "id": "d12_10", "text": "He llorado con facilidad.", "weight": 1, "isInverse": true },
      { "id": "d12_11", "text": "Me he sentido activo/a y con ganas de hacer cosas.", "weight": 1 },
      { "id": "d12_12", "text": "Siento que el futuro parece sombrío.", "weight": 1, "isInverse": true }
    ]
  },
  {
    "id": "dim13",
    "name": "Ansiedad Estado (Nivel de Alarma Interna)",
    "definition": "Mide tu nivel de ansiedad, preocupación y tensión en las últimas semanas. Evalúa la presencia de síntomas físicos (tensión, inquietud) y mentales (pensamientos recurrentes, catastrofismo) asociados a la ansiedad.",
    "recommendedPathId": "regular-ansiedad-paso-a-paso",
    "items": [
      { "id": "d13_1", "text": "Me he sentido tenso/a o nervioso/a.", "weight": 1, "isInverse": true },
      { "id": "d13_2", "text": "He sido capaz de relajarme y sentirme a gusto.", "weight": 1 },
      { "id": "d13_3", "text": "He tenido pensamientos o imágenes que me asustan.", "weight": 1, "isInverse": true },
      { "id": "d13_4", "text": "Me he sentido con la mente en calma y tranquila.", "weight": 1 },
      { "id": "d13_5", "text": "He notado que mi corazón latía deprisa o de forma irregular.", "weight": 1, "isInverse": true },
      { "id": "d13_6", "text": "He sentido pánico o un miedo repentino.", "weight": 1, "isInverse": true }
    ]
  }
]
